# 1 - Importer pandas et numpy

In [106]:
import pandas as pd
import numpy as np

# 2 - Importer dans un DF nommé prenom le fichier naissance.csv

In [107]:
data = pd.read_csv('naissance.csv')
data

     Unnamed: 0       Id   Prenom    An Sexe Etat  Nombre
0         11349    11350     Emma  2004    F   AK      62
1         11350    11351  Madison  2004    F   AK      48
2         11351    11352   Hannah  2004    F   AK      46
3         11352    11353    Grace  2004    F   AK      44
4         11353    11354    Emily  2004    F   AK      41
..          ...      ...      ...   ...  ...  ...     ...
665     1908858  1908859   Skylar  2008    F   KS      18
666     1908859  1908860  Adeline  2008    F   KS      17
667     1908860  1908861   Alayna  2008    F   KS      17
668     1908861  1908862      Ana  2008    F   KS      17
669     1908862  1908863    Angel  2008    F   KS      17

[670 rows x 7 columns]

In [108]:
prenom = data["Prenom"]
prenom

0         Emma
1      Madison
2       Hannah
3        Grace
4        Emily
        ...
665     Skylar
666    Adeline
667     Alayna
668        Ana
669      Angel
Name: Prenom, Length: 670, dtype: object

# 3 - afficher des infos sur le DataFrame

In [109]:
data.info

<bound method DataFrame.info of      Unnamed: 0       Id   Prenom    An Sexe Etat  Nombre
0         11349    11350     Emma  2004    F   AK      62
1         11350    11351  Madison  2004    F   AK      48
2         11351    11352   Hannah  2004    F   AK      46
3         11352    11353    Grace  2004    F   AK      44
4         11353    11354    Emily  2004    F   AK      41
..          ...      ...      ...   ...  ...  ...     ...
665     1908858  1908859   Skylar  2008    F   KS      18
666     1908859  1908860  Adeline  2008    F   KS      17
667     1908860  1908861   Alayna  2008    F   KS      17
668     1908861  1908862      Ana  2008    F   KS      17
669     1908862  1908863    Angel  2008    F   KS      17

[670 rows x 7 columns]>

# 4 -Afficher les 10 premières lignes

In [110]:
data.head(2)

   Unnamed: 0     Id   Prenom    An Sexe Etat  Nombre
0       11349  11350     Emma  2004    F   AK      62
1       11350  11351  Madison  2004    F   AK      48

# 5 - Supprimer les colonnes  'Unnamed: 0' et 'Id' et "an"

In [111]:
del data['An']

In [112]:
data = data.drop(labels=['Unnamed: 0','Id'], axis='columns')

# 6 - Donner la répartition en qte homme - femme

In [113]:
data['Sexe'].value_counts()

F    572
M     98
Name: Sexe, dtype: int64

# 7 - Grouper les données par 'Prenom' et assigner à nom

In [115]:
data.groupby('Prenom')

In [116]:
nom = data.groupby('Prenom').sum()
nom

          Nombre
Prenom
Aaliyah      122
Abbie         32
Abbygail      18
Abigail       37
Abrielle       7
...          ...
Zion          22
Zipporah       8
Zoe          109
Zoie          11
Zuleyka        8

[603 rows x 1 columns]

# 8 - Trier sur la colonne count dans l'ordre descendant

In [117]:
nom.sort_values("Nombre",ascending=0)

           Nombre
Prenom
Tylan        1312
Anna          139
Nora          132
Kennedy       126
Caroline      124
...           ...
Brookelyn       7
Grayson         7
Cailin          7
Gemma           7
Chassidy        7

[603 rows x 1 columns]

# 9 - Quel est la médiane de la colonne count

In [143]:
nom['Nombre'].median()

18.0

# 10 - Afficher un résumé avec la moyenne, le min, le max

In [144]:
nom['Nombre'].describe()

count     603.000000
mean       26.615257
std        58.111057
min         7.000000
25%        11.000000
50%        18.000000
75%        23.000000
max      1312.000000
Name: Nombre, dtype: float64

In [145]:
nom['Nombre'].min()

7

In [146]:
nom['Nombre'].max()

1312

In [148]:
nom['Nombre'].mean()

26.615257048092868